In [2]:
import pandas as pd

In [3]:
ls

archive.zip  ass1_dataset.csv  eda.ipynb  goeda_row.xlsx

In [4]:
import csv
import json

# 读取 CSV 文件
csv_file = 'ass1_dataset.csv'
json_file = 'ass1_dataset.json'

df = pd.read_csv(csv_file,encoding='ISO-8859-1')
df.columns

Index(['rank', 'Youtuber', 'subscribers', 'video views', 'category', 'Title',
       'uploads', 'Country', 'Abbreviation', 'channel_type',
       'video_views_rank', 'country_rank', 'channel_type_rank',
       'video_views_for_the_last_30_days', 'lowest_monthly_earnings',
       'highest_monthly_earnings', 'lowest_yearly_earnings',
       'highest_yearly_earnings', 'subscribers_for_last_30_days',
       'created_year', 'created_month', 'created_date',
       'Gross tertiary education enrollment (%)', 'Population',
       'Unemployment rate', 'Urban_population', 'Latitude', 'Longitude'],
      dtype='object')

In [5]:
df.groupby('Country').count()[['rank']].sort_values(by='rank',ascending=False)[:5]

                rank
Country
United States    313
India            168
Brazil            62
United Kingdom    43
Mexico            33

In [6]:
us_df = df.loc[df['Country']=='United States',:]

In [14]:
nan_df = df.loc[df['Country'].isna(),:]
nan_df

,rank,Youtuber,subscribers,video views,category,Title,uploads,Country,Abbreviation,channel_type,...,subscribers_for_last_30_days,created_year,created_month,created_date,Gross tertiary education enrollment (%),Population,Unemployment rate,Urban_population,Latitude,Longitude
5,6,Music,119000000,0.000000e+00,NaN,Music,0,NaN,NaN,Music,...,NaN,2013.0,Sep,24.0,NaN,NaN,NaN,NaN,NaN,NaN
12,13,Gaming,93600000,0.000000e+00,NaN,Gaming,0,NaN,NaN,Games,...,NaN,2013.0,Dec,15.0,NaN,NaN,NaN,NaN,NaN,NaN
14,15,Goldmines,86900000,2.411823e+10,Film & Animation,goldmines,1,NaN,NaN,Music,...,NaN,2006.0,Aug,15.0,NaN,NaN,NaN,NaN,NaN,NaN
38,39,LooLoo Kids - Nursery Rhymes and Children's Songs,54000000,3.231243e+10,Music,LooLoo Kids - Nursery Rhymes and Children's ï¿½,11,NaN,NaN,NaN,...,NaN,2016.0,Nov,29.0,NaN,NaN,NaN,NaN,NaN,NaN
48,49,Badabun,46800000,1.939805e+10,Entertainment,badabun,1,NaN,NaN,Music,...,75.0,2007.0,Jul,21.0,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
958,959,Troom Troom PT,12500000,4.384178e+09,Howto & Style,Troom Troom PT,2738,NaN,NaN,Howto,...,NaN,2015.0,Apr,19.0,NaN,NaN,NaN,NaN,NaN,NaN
967,968,Troom Troom Indonesia,12500000,5.379684e+09,People & Blogs,TROOM TROOM INDONESIA,8,NaN,NaN,People,...,NaN,2020.0,Jul,29.0,NaN,NaN,NaN,NaN,NaN,NaN
972,973,Hero Movies 2023,12400000,1.689091e+09,People & Blogs,Hero Movies 2023,689,NaN,NaN,People,...,NaN,2017.0,Feb,22.0,NaN,NaN,NaN,NaN,NaN,NaN
985,986,TKOR,12400000,3.392023e+09,Education,TKoR,0,NaN,NaN,People,...,NaN,2006.0,Aug,16.0,NaN,NaN,NaN,NaN,NaN,NaN
986,987,ANNA KOVA,12400000,1.395959e+10,People & Blogs,annakova,1,NaN,NaN,Film,...,NaN,2006.0,Jun,18.0,NaN,NaN,NaN,NaN,NaN,NaN

In [ ]:
df.loc[df['Country']==['United States',],:]

In [7]:
pd.options.display.float_format = '{:.0f}'.format

In [8]:
df[['video views','category']].groupby('category').sum().sort_values(by='video views',ascending=False)

                        video views
category
Music                 3121477506633
Entertainment         2527739309583
People & Blogs        1265791201548
Gaming                 717638899629
Education              696614472899
Comedy                 550112774315
Film & Animation       544422509313
Shows                  446206826909
News & Politics        270391919347
Howto & Style          201817545540
Sports                 147986290620
Science & Technology    66976747110
Pets & Animals          44866745899
Trailers                33262717607
Movies                  15383255129
Autos & Vehicles        15003458141
Nonprofits & Activism   10862911785
Travel & Events          3140883140

In [9]:
view_byvid = df.groupby(['Country','category'])[['video views']].sum()

In [10]:
df.loc[(df['Country']=='India'),:].groupby('category')['video views'].sum()

category
Comedy                  99718638450
Education              179179308515
Entertainment          551343827960
Film & Animation       110125421502
Gaming                   3864199945
Howto & Style           18397094400
Movies                  15383255129
Music                  673625200058
News & Politics        110082745690
People & Blogs         122744120145
Science & Technology    12490209066
Shows                  345677199342
Trailers                33262717607
Name: video views, dtype: float64

In [11]:
def sort_byview(group):
    return group.sort_values(ascending=False)

In [12]:
view_byvid.apply(sort_byview).to_excel('goeda_row.xlsx')

In [25]:
import matplotlib
view_byvid.iloc[2,2:5]

Series([], Name: (Argentina, Comedy), dtype: float64)